{"config": [{"config": {"init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "nb_col": 3, "name": "convolution2d_7", "b_regularizer": null, "W_constraint": null, "input_dtype": "float32", "bias": true, "batch_input_shape": [null, 1, 128, 128], "nb_filter": 32, "nb_row": 3, "activation": "linear", "W_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "activation_13", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "nb_col": 3, "subsample": [1, 1], "trainable": true, "b_constraint": null, "activity_regularizer": null, "dim_ordering": "th", "nb_row": 3, "b_regularizer": null, "W_constraint": null, "border_mode": "valid", "bias": true, "nb_filter": 32, "name": "convolution2d_8", "activation": "linear", "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "activation_14", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "name": "maxpooling2d_4", "dim_ordering": "th"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "trainable": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_7", "output_dim": 128}, "class_name": "Dense"}, {"config": {"name": "activation_15", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"p": 0.5, "name": "dropout_8", "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "linear", "trainable": true, "b_constraint": null, "activity_regularizer": null, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "name": "dense_8", "output_dim": 2}, "class_name": "Dense"}, {"config": {"name": "activation_16", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.2"}