{"config": [{"config": {"trainable": true, "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_29", "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 1, 128, 128], "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "dim_ordering": "th", "nb_filter": 32, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_57"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_30", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "dim_ordering": "th", "nb_filter": 32, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_58"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_15"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_29"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_15"}, "class_name": "Flatten"}, {"config": {"trainable": true, "output_dim": 128, "b_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_29", "W_constraint": null, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_59"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_30"}, "class_name": "Dropout"}, {"config": {"trainable": true, "output_dim": 2, "b_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_30", "W_constraint": null, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_60"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.2"}