{"config": [{"config": {"trainable": true, "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_21", "input_dtype": "float32", "W_regularizer": null, "batch_input_shape": [null, 1, 128, 128], "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "dim_ordering": "th", "nb_filter": 32, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_41"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_constraint": null, "W_constraint": null, "subsample": [1, 1], "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "convolution2d_22", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "dim_ordering": "th", "nb_filter": 32, "nb_row": 3}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_42"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "strides": [2, 2], "dim_ordering": "th", "name": "maxpooling2d_11"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_21"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_11"}, "class_name": "Flatten"}, {"config": {"trainable": true, "output_dim": 128, "b_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_21", "W_constraint": null, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_43"}, "class_name": "Activation"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_22"}, "class_name": "Dropout"}, {"config": {"trainable": true, "output_dim": 2, "b_constraint": null, "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "name": "dense_22", "W_constraint": null, "b_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_44"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.1.2"}